IDEA StatiCa Open Model
TendonStressLoading Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Tendon stress loading
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.Load.TendonLoading
 IdeaRS.OpenModel.Concrete.Load.TendonStressLoading
 Namespace: IdeaRS.OpenModel.Concrete.Load
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class TendonStressLoading : TendonLoading
Public Class TendonStressLoading
	Inherits TendonLoading
public ref class TendonStressLoading : public TendonLoading
The TendonStressLoading type exposes the following members.
Constructors
Name | Description
TendonStressLoading
 Constructor
Top
Properties
Name | Description
Stresses
 Tendon stress
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.Load Namespace